status/2021/03dec21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>27 November 2021 - 03 December 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">27 November 2021 - 03 December 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge8bf11f">1. MIT OCW</a>
<ul>
<li><a href="#org602f109">1.1. 18.01 - Single Variable Calculus</a>
<ul>
<li><a href="#org6bb0588">1.1.1. Sessions 77-79</a></li>
</ul>
</li>
<li><a href="#org68ade4f">1.2. 8.01X - Physics I - Classical Mechanics with Labs</a></li>
</ul>
</li>
<li><a href="#orgd07c434">2. LA County index map</a></li>
<li><a href="#orge083146">3. Mill Controller #2</a></li>
<li><a href="#orgacc6473">4. WWVB Decoder</a></li>
<li><a href="#org5798a03">5. Santa Cruz Weather Station</a></li>
<li><a href="#orgf0ed556">6. Marble Computation</a>
<ul>
<li><a href="#org7bedce3">6.1. Next Steps</a>
<ul>
<li><a href="#orgbb03119">6.1.1. Continue Reversible Computation Study</a></li>
<li><a href="#org4812693">6.1.2. Prototype Marble inverter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga4bab45">7. ca-r</a>
<ul>
<li><a href="#orge0f4b16">7.1. Next Step</a></li>
</ul>
</li>
<li><a href="#org5c0fdb1">8. us-index-map</a>
<ul>
<li><a href="#org4d21b13">8.1. error analysis</a></li>
</ul>
</li>
<li><a href="#org1f1074d">9. Sun Ultra 10</a>
<ul>
<li><a href="#org3356805">9.1. Next steps</a>
<ul>
<li><a href="#orgc9cc088">9.1.1. Serial debug</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga547218">10. Apple iMac G4</a>
<ul>
<li><a href="#org3645380">10.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org1981705">11. Davies Brothel</a>
<ul>
<li><a href="#org559cae1">11.1. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org35885a6">11.2. Next hearing 14jan2022. Still no PACER.</a></li>
</ul>
</li>
<li><a href="#orgec43c95">12. Peter Kim</a>
<ul>
<li><a href="#orgff97be3">12.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#orge810954">12.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#org9e91c4c">12.3. Next hearing: 1/31/2022 01:30 PM</a></li>
</ul>
</li>
<li><a href="#org587d14a">13. Linux Audio</a>
<ul>
<li><a href="#orgad62191">13.1. pvanal to spectrogram</a>
<ul>
<li><a href="#orge8e48b3">13.1.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org95f6e39">13.2. CSound programming.</a>
<ul>
<li><a href="#org2f8cbac">13.2.1. Next Steps</a></li>
</ul>
</li>
<li><a href="#orgc12b970">13.3. Faust programming</a>
<ul>
<li><a href="#orgb25634b">13.3.1. Next Steps</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb1b5745">14. EPICS</a>
<ul>
<li><a href="#org9861295">14.1. Next steps</a>
<ul>
<li><a href="#orgb40737f">14.1.1. Started CGR-101 SCPI interface</a></li>
<li><a href="#orgd47c43b">14.1.2. u3scpi network port testing</a></li>
<li><a href="#org0ac7322">14.1.3. initial EPICS interface</a></li>
<li><a href="#org79de5c0">14.1.4. u3scpi analog/digital port reconfiguration.</a></li>
<li><a href="#org4db4cc9">14.1.5. u3scpi 'DIGITIZER' subsystem.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcaef9ff">15. Brini Tracker II</a>
<ul>
<li><a href="#orge13ac8b">15.1. Next steps</a>
<ul>
<li><a href="#org9b5c32e">15.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#orgc5a0278">15.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org5bbf450">15.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1004722">16. wktcolor</a>
<ul>
<li><a href="#org9dcbaec">16.1. Next steps</a>
<ul>
<li><a href="#orgc2563a0">16.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6698f4f">17. wktplot</a>
<ul>
<li><a href="#org3fdc148">17.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org77afd41">18. AMDGPU</a>
<ul>
<li><a href="#org2bea070">18.1. Next step</a>
<ul>
<li><a href="#org25a4035">18.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5b8e49f">19. Ninja v Make</a>
<ul>
<li><a href="#org0c1e948">19.1. Next Step</a>
<ul>
<li><a href="#orgfdd4239">19.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0e287c7">20. GMP Forth</a>
<ul>
<li><a href="#org11753f6">20.1. Need to think about adding floating point support</a></li>
<li><a href="#org518d969">20.2. Port to non-Linux OS</a></li>
</ul>
</li>
<li><a href="#org65d4a6c">21. Swocer</a>
<ul>
<li><a href="#org5018d4e">21.1. Most crashing addressed</a></li>
<li><a href="#org7f83908">21.2. Added outline for 'bottle' test</a></li>
<li><a href="#orga231cc9">21.3. Next steps</a></li>
</ul>
</li>
<li><a href="#org36084f9">22. Books</a>
<ul>
<li><a href="#orgee94371">22.1. Janus Point, Julian Barbour</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
December already?
</p>

<div id="outline-container-orge8bf11f" class="outline-2">
<h2 id="orge8bf11f"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org602f109" class="outline-3">
<h3 id="org602f109"><span class="section-number-3">1.1.</span> 18.01 - Single Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org6bb0588" class="outline-4">
<h4 id="org6bb0588"><span class="section-number-4">1.1.1.</span> Sessions 77-79</h4>
</div>
</div>
<div id="outline-container-org68ade4f" class="outline-3">
<h3 id="org68ade4f"><span class="section-number-3">1.2.</span> 8.01X - Physics I - Classical Mechanics with Labs</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Planning complete, materials identified.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd07c434" class="outline-2">
<h2 id="orgd07c434"><span class="section-number-2">2.</span> LA County index map</h2>
<div class="outline-text-2" id="text-2">
<p>
No changes.
</p>
</div>
</div>
<div id="outline-container-orge083146" class="outline-2">
<h2 id="orge083146"><span class="section-number-2">3.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-3">
<p>
Need to design own IO board for 5V I/O.
</p>
</div>
</div>
<div id="outline-container-orgacc6473" class="outline-2">
<h2 id="orgacc6473"><span class="section-number-2">4.</span> WWVB Decoder</h2>
<div class="outline-text-2" id="text-4">
<p>
Need to re-think.
</p>
</div>
</div>
<div id="outline-container-org5798a03" class="outline-2">
<h2 id="org5798a03"><span class="section-number-2">5.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-5">
<p>
Maybe Rain Gauge is still working. It's be nice to get some rain.
</p>
</div>
</div>
<div id="outline-container-orgf0ed556" class="outline-2">
<h2 id="orgf0ed556"><span class="section-number-2">6.</span> Marble Computation</h2>
<div class="outline-text-2" id="text-6">
<p>
Collected materials (thin copper plate, copper PCB blanks) for prototyping.
</p>
</div>
<div id="outline-container-org7bedce3" class="outline-3">
<h3 id="org7bedce3"><span class="section-number-3">6.1.</span> Next Steps</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orgbb03119" class="outline-4">
<h4 id="orgbb03119"><span class="section-number-4">6.1.1.</span> Continue Reversible Computation Study</h4>
</div>
<div id="outline-container-org4812693" class="outline-4">
<h4 id="org4812693"><span class="section-number-4">6.1.2.</span> Prototype Marble inverter</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
Using dual rail differential logic (left/,right/1), an inverter
merely switches sides. Now thinking an over-center spring controlling
a 'side gate' controlled by a pair of sense levers.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orga4bab45" class="outline-2">
<h2 id="orga4bab45"><span class="section-number-2">7.</span> ca-r</h2>
<div class="outline-text-2" id="text-7">
<p>
Issue #33 seems to have fixed itself.
</p>
</div>
<div id="outline-container-orge0f4b16" class="outline-3">
<h3 id="orge0f4b16"><span class="section-number-3">7.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Wait for further breakage.
</p>
</div>
</div>
</div>
<div id="outline-container-org5c0fdb1" class="outline-2">
<h2 id="org5c0fdb1"><span class="section-number-2">8.</span> us-index-map</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org4d21b13" class="outline-3">
<h3 id="org4d21b13"><span class="section-number-3">8.1.</span> error analysis</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Started an error analysis on the USGS topomaps<sub>all.csv</sub> index file. Nothing obvious pops up,
and the error reported by Maureen would be impossible to catch anyway.
</p>
</div>
</div>
</div>
<div id="outline-container-org1f1074d" class="outline-2">
<h2 id="org1f1074d"><span class="section-number-2">9.</span> Sun Ultra 10</h2>
<div class="outline-text-2" id="text-9">
<p>
Trying to see what state it is in. Fires up but no video. Need DB25M to
debug over serial port.
</p>
</div>
<div id="outline-container-org3356805" class="outline-3">
<h3 id="org3356805"><span class="section-number-3">9.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-orgc9cc088" class="outline-4">
<h4 id="orgc9cc088"><span class="section-number-4">9.1.1.</span> Serial debug</h4>
</div>
</div>
</div>
<div id="outline-container-orga547218" class="outline-2">
<h2 id="orga547218"><span class="section-number-2">10.</span> Apple iMac G4</h2>
<div class="outline-text-2" id="text-10">
<p>
Building userland may be a PITA due to lack of RAM. Build would often
segfault.
</p>
</div>
<div id="outline-container-org3645380" class="outline-3">
<h3 id="org3645380"><span class="section-number-3">10.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Not sure.
</p>
</div>
</div>
</div>

<div id="outline-container-org1981705" class="outline-2">
<h2 id="org1981705"><span class="section-number-2">11.</span> Davies Brothel</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org559cae1" class="outline-3">
<h3 id="org559cae1"><span class="section-number-3">11.1.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org35885a6" class="outline-3">
<h3 id="org35885a6"><span class="section-number-3">11.2.</span> Next hearing 14jan2022. Still no PACER.</h3>
</div>
</div>
<div id="outline-container-orgec43c95" class="outline-2">
<h2 id="orgec43c95"><span class="section-number-2">12.</span> Peter Kim</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-orgff97be3" class="outline-3">
<h3 id="orgff97be3"><span class="section-number-3">12.1.</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-orge810954" class="outline-3">
<h3 id="orge810954"><span class="section-number-3">12.2.</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-org9e91c4c" class="outline-3">
<h3 id="org9e91c4c"><span class="section-number-3">12.3.</span> Next hearing: 1/31/2022 01:30 PM</h3>
</div>
</div>
<div id="outline-container-org587d14a" class="outline-2">
<h2 id="org587d14a"><span class="section-number-2">13.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orgad62191" class="outline-3">
<h3 id="orgad62191"><span class="section-number-3">13.1.</span> pvanal to spectrogram</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Enough of libriffr and libpvocf work to start pvoctool
<a href="https://github.com/daniel-kelley/pvoctool">https://github.com/daniel-kelley/pvoctool</a>. Have HDF5 output and
text delimited output for octave. Can import PVOC data to octave
spectrogram for display.
</p>
</div>
<div id="outline-container-orge8e48b3" class="outline-4">
<h4 id="orge8e48b3"><span class="section-number-4">13.1.1.</span> Next steps</h4>
<div class="outline-text-4" id="text-13-1-1">
<p>
Loop analysis
</p>
</div>
</div>
</div>
<div id="outline-container-org95f6e39" class="outline-3">
<h3 id="org95f6e39"><span class="section-number-3">13.2.</span> CSound programming.</h3>
<div class="outline-text-3" id="text-13-2">
<p>
The FORTRAN of computer music. Getting up to speed.
</p>
</div>
<div id="outline-container-org2f8cbac" class="outline-4">
<h4 id="org2f8cbac"><span class="section-number-4">13.2.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-13-2-1">
</div>
<ol class="org-ol">
<li><a id="org64f2b9e"></a>loscil demo<br /></li>
<li><a id="org4afb64b"></a>spectrogram loop point analysis<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgc12b970" class="outline-3">
<h3 id="orgc12b970"><span class="section-number-3">13.3.</span> Faust programming</h3>
<div class="outline-text-3" id="text-13-3">
</div>
<div id="outline-container-orgb25634b" class="outline-4">
<h4 id="orgb25634b"><span class="section-number-4">13.3.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-13-3-1">
</div>
<ol class="org-ol">
<li><a id="org30ef5c9"></a>GAC Patch save/restore<br /></li>
<li><a id="orgdfe3e06"></a>LV2 autopatcher<br />
<div class="outline-text-5" id="text-13-3-1-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</li>
<li><a id="org41e90a4"></a>OSC control surface<br />
<div class="outline-text-5" id="text-13-3-1-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</li>
<li><a id="orgd5675be"></a>Faust/csound<br />
<div class="outline-text-5" id="text-13-3-1-4">
<p>
See if a faust generated unit works.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgb1b5745" class="outline-2">
<h2 id="orgb1b5745"><span class="section-number-2">14.</span> EPICS</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org9861295" class="outline-3">
<h3 id="org9861295"><span class="section-number-3">14.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-14-1">
</div>
<div id="outline-container-orgb40737f" class="outline-4">
<h4 id="orgb40737f"><span class="section-number-4">14.1.1.</span> Started CGR-101 SCPI interface</h4>
<div class="outline-text-4" id="text-14-1-1">
</div>
<ol class="org-ol">
<li><a id="org0811a35"></a>Will help test u3scpi<br /></li>
<li><a id="org82f7971"></a>Using flex/bison SCPI parser<br />
<div class="outline-text-5" id="text-14-1-1-2">
<p>
Initial SCPI design complete with code stubs. Refactored output/error
modules. Planning dev/emulation interface.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgd47c43b" class="outline-4">
<h4 id="orgd47c43b"><span class="section-number-4">14.1.2.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-org0ac7322" class="outline-4">
<h4 id="org0ac7322"><span class="section-number-4">14.1.3.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-org79de5c0" class="outline-4">
<h4 id="org79de5c0"><span class="section-number-4">14.1.4.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
<div id="outline-container-org4db4cc9" class="outline-4">
<h4 id="org4db4cc9"><span class="section-number-4">14.1.5.</span> u3scpi 'DIGITIZER' subsystem.</h4>
</div>
</div>
</div>

<div id="outline-container-orgcaef9ff" class="outline-2">
<h2 id="orgcaef9ff"><span class="section-number-2">15.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-15">
<p>
Maybe this can be simplified to just the GPS module in 'tracking' mode
(which gets carried around), and a separate docking module to extract
the data.
</p>
</div>
<div id="outline-container-orge13ac8b" class="outline-3">
<h3 id="orge13ac8b"><span class="section-number-3">15.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-15-1">
</div>
<div id="outline-container-org9b5c32e" class="outline-4">
<h4 id="org9b5c32e"><span class="section-number-4">15.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-orgc5a0278" class="outline-4">
<h4 id="orgc5a0278"><span class="section-number-4">15.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org5bbf450" class="outline-4">
<h4 id="org5bbf450"><span class="section-number-4">15.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-org1004722" class="outline-2">
<h2 id="org1004722"><span class="section-number-2">16.</span> wktcolor</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org9dcbaec" class="outline-3">
<h3 id="org9dcbaec"><span class="section-number-3">16.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-16-1">
</div>
<div id="outline-container-orgc2563a0" class="outline-4">
<h4 id="orgc2563a0"><span class="section-number-4">16.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-16-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org6698f4f" class="outline-2">
<h2 id="org6698f4f"><span class="section-number-2">17.</span> wktplot</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-org3fdc148" class="outline-3">
<h3 id="org3fdc148"><span class="section-number-3">17.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-17-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
Explore biological cell Voronoi organization
</p>
</div>
</div>
</div>

<div id="outline-container-org77afd41" class="outline-2">
<h2 id="org77afd41"><span class="section-number-2">18.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-org2bea070" class="outline-3">
<h3 id="org2bea070"><span class="section-number-3">18.1.</span> Next step</h3>
<div class="outline-text-3" id="text-18-1">
</div>
<div id="outline-container-org25a4035" class="outline-4">
<h4 id="org25a4035"><span class="section-number-4">18.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-org5b8e49f" class="outline-2">
<h2 id="org5b8e49f"><span class="section-number-2">19.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-org0c1e948" class="outline-3">
<h3 id="org0c1e948"><span class="section-number-3">19.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-19-1">
</div>
<div id="outline-container-orgfdd4239" class="outline-4">
<h4 id="orgfdd4239"><span class="section-number-4">19.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-org0e287c7" class="outline-2">
<h2 id="org0e287c7"><span class="section-number-2">20.</span> GMP Forth</h2>
<div class="outline-text-2" id="text-20">
</div>
<div id="outline-container-org11753f6" class="outline-3">
<h3 id="org11753f6"><span class="section-number-3">20.1.</span> Need to think about adding floating point support</h3>
</div>
<div id="outline-container-org518d969" class="outline-3">
<h3 id="org518d969"><span class="section-number-3">20.2.</span> Port to non-Linux OS</h3>
</div>
</div>
<div id="outline-container-org65d4a6c" class="outline-2">
<h2 id="org65d4a6c"><span class="section-number-2">21.</span> Swocer</h2>
<div class="outline-text-2" id="text-21">
</div>
<div id="outline-container-org5018d4e" class="outline-3">
<h3 id="org5018d4e"><span class="section-number-3">21.1.</span> Most crashing addressed</h3>
<div class="outline-text-3" id="text-21-1">
<p>
Nullified 'handle' API free functions helped a lot.
Still see some errors in operations.
</p>
</div>
</div>
<div id="outline-container-org7f83908" class="outline-3">
<h3 id="org7f83908"><span class="section-number-3">21.2.</span> Added outline for 'bottle' test</h3>
<div class="outline-text-3" id="text-21-2">
<p>
Added all functions believed to be needed for 'bottle' demo test.
Test doesn't pass so is disabled.
</p>
</div>
</div>
<div id="outline-container-orga231cc9" class="outline-3">
<h3 id="orga231cc9"><span class="section-number-3">21.3.</span> Next steps</h3>
<div class="outline-text-3" id="text-21-3">
<p>
Swocer future.
Check out what's needed for gears.
</p>
</div>
</div>
</div>
<div id="outline-container-org36084f9" class="outline-2">
<h2 id="org36084f9"><span class="section-number-2">22.</span> Books</h2>
<div class="outline-text-2" id="text-22">
</div>
<div id="outline-container-orgee94371" class="outline-3">
<h3 id="orgee94371"><span class="section-number-3">22.1.</span> Janus Point, Julian Barbour</h3>
<div class="outline-text-3" id="text-22-1">
<p>
Latest on Shape Dynamics
<a href="https://www.barnesandnoble.com/w/the-janus-point-julian-barbour/1135968121?ean=9780465095469">https://www.barnesandnoble.com/w/the-janus-point-julian-barbour/1135968121?ean=9780465095469</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>